examples/flows/compiled/complex_with_while/flow.mmd
flowchart TD
    %% Flow: complex_flow

    handler_check_quality[handler_check_quality]
    handler_enrich_data[handler_enrich_data]
    handler_error([handler_error])
    handler_finalize[handler_finalize]
    handler_preprocess[handler_preprocess]
    handler_retry_handler[handler_retry_handler]
    handler_transform_batch[handler_transform_batch]
    handler_validate[handler_validate]
    router_complex_flow_line_15_if_6{{router_complex_flow_line_15_if_6}}
    router_complex_flow_line_19_if_5{{router_complex_flow_line_19_if_5}}
    router_complex_flow_line_22_while_1{{router_complex_flow_line_22_while_1}}
    router_complex_flow_line_26_if_3{{router_complex_flow_line_26_if_3}}
    router_complex_flow_line_29_if_2{{router_complex_flow_line_29_if_2}}
    router_complex_flow_line_32_if_4{{router_complex_flow_line_32_if_4}}
    start_complex_flow([start_complex_flow])

    start_complex_flow --> handler_preprocess
    handler_preprocess --> handler_validate
    handler_validate --> router_complex_flow_line_15_if_6
    router_complex_flow_line_26_if_3 -->|p['quality_score'] < 20| router_complex_flow_line_22_while_1
    router_complex_flow_line_26_if_3 -->|not (p['quality_score'] < 20)| router_complex_flow_line_29_if_2
    router_complex_flow_line_22_while_1 -->|p.get('batch_count', 0) < p.get('max_batches', 3)| handler_transform_batch
    handler_transform_batch --> handler_check_quality
    handler_check_quality --> router_complex_flow_line_26_if_3
    router_complex_flow_line_32_if_4 -->|p.get('requires_retry')| handler_retry_handler
    router_complex_flow_line_19_if_5 -->|p.get('needs_enrichment')| handler_enrich_data
    handler_enrich_data --> router_complex_flow_line_22_while_1
    router_complex_flow_line_19_if_5 -->|not (p.get('needs_enrichment'))| router_complex_flow_line_32_if_4
    router_complex_flow_line_15_if_6 -->|not (not p['valid'])| router_complex_flow_line_19_if_5
    router_complex_flow_line_15_if_6 -->|not p['valid']| handler_error
    handler_finalize --> router_complex_flow_line_22_while_1
    router_complex_flow_line_29_if_2 --> router_complex_flow_line_22_while_1
    handler_retry_handler --> handler_finalize
